iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
   // Настройка фильтра 0 (CAN1) для приема широковещательных фреймов
   // Маска          :  1 00000000 0   маска на 10 бит
   // Идентификатор  :  1 00000000 0   10 бит включен (признак широковещательного фрейма)
   CAN_FilterConfTypeDef CAN_FilterInitStructure;
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = 0x0200 << 3;
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x0200 << 3;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 0;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 0;        // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);
   
   // Настройка фильтра 1 (CAN1) для приема адресного фрейма
   // Маска          :  1 11111111 0   маска на 10 бит
   // Идентификатор  :  0 AAAAAAAA 0   10 бит выключен (признак адресного фрейма), биты от 9-1 адрес
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = in_u8Address << (3 + 1);
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x03FE << 3;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 1;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 0;        // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);

   HAL_CAN_Receive_IT(&hcan, CAN_FIFO0);
}

/**
   Отправка сообщения на шину
   на входе    :  in_bBroadcast  - признак широковещательно пакета
                  in_u8Address   - адрес кому предназначен пакет
                  in_pBuffer     - указатель на отправляемые данные
                  in_stSize      - размер отправляемых данных
   на выходе   :  успешность отправки данных
*/
bool BUS_Write(bool in_bBroadcast, u8 in_u8Address, void* in_pBuffer, size_t in_stSize)
{
   return g_ExtCAN.AddPacket(in_bBroadcast, in_u8Address, in_pBuffer, in_stSize);
}

/////////////////////////////////////////////////////////////////////////////////////////////////
//// Работа с таймером
/////////////////////////////////////////////////////////////////////////////////////////////////

/**
   Получение количества микросекунд
   на входе   :  *
   на выходе  :  количество микросекунд с начала работы
*/
uint32_t TIMER_micros()
{
   register uint32_t l_u32Ms = 0;
   register uint32_t l_u32Cycle = 0;
   do
   {
      l_u32Ms = HAL_GetTick();
      l_u32Cycle = SysTick->VAL;
   } while(l_u32Ms != HAL_GetTick());

   return (l_u32Ms * 1000) + (g_u32TickPerUs * 1000 - l_u32Cycle) / g_u32TickPerUs;
}

/**
   Ожидания указанного количества миллисекунд
   на входе    :  in_u32Millis - количество миллисекунд
   на выходе   :  *
*/
void TIMER_DelayMillis(uint32_t in_u32Millis)
{
   uint32_t l_u32End = HAL_GetTick() + in_u32Millis;
   while(HAL_GetTick() < l_u32End) ;
}

/**
   Ожидания указанного количества микросекунд
   на входе    :  in_u32Micros   - количество микросекунд
   на выходе   :  *
*/
void TIMER_DelayMicros(uint32_t in_u32Micros)
{
   uint32_t l_u32End = TIMER_micros() + in_u32Micros;
   while(TIMER_micros() < l_u32End) ;
}

/**
   Перезагрузка микроконтроллера
   на входе    :  *
   на выходе   :  *
*/
void Reboot()
{
   NVIC_SystemReset();
}

/**
   Генерация HWID устройства
   на входе    :  in_pHWID    - указатель на буфер куда нужно поместить строку с HWID
                  in_stSize   - размер буфера
   на выходе   :  успешность получения
   примечание  :  HWID это строка шеснадцатеричного представления 16 байтного значения.
                  Длинна строки 33 байта (32 байта + 1 байт конец)
*/
static void GenerateHWID()
{
   char l_szHexTab[] = "0123456789ABCDEF";
   u8 l_aHash[STREEBOG_BLOCK_SIZE];
   CIridiumStreebog l_Streebog;
   
   // Вычисление хэша для 96 битного идентификатора устройства
   l_Streebog.Calc((const void*)UID_BASE, 12, l_aHash, sizeof(l_aHash), SHT_HASH_256);

   // Преобразование хэша в строку
   char* l_pszHWID = g_pszHWID;
   for(size_t i = 0; i < STREEBOG_HASH_256_BYTES / 2; i++)
   {
      u8 l_u8Byte = l_aHash[i] ^ l_aHash[STREEBOG_HASH_256_BYTES / 2 + i];
      *l_pszHWID++ = l_szHexTab[l_u8Byte >> 4];
      *l_pszHWID++ = l_szHexTab[l_u8Byte & 0xF];
   }
   *l_pszHWID = 0;
}

/**
   Конструктор класса
   на входе    :  *
*/
CDevice::CDevice() : CIridiumBusProtocol()
{
   m_u16TID = 0;

   // Настройка входящего буфера
   m_InBuffer.SetBuffer(m_aInBuffer, IRIDIUM_BUS_IN_BUFFER_SIZE);
   m_InBuffer.Clear();

   // Установка указателей на методы блокирования и разблокирования входящего буфера   
   m_InBuffer.SetLockUnlock(LockInBuffer, UnLockInBuffer);
   
   // Настройка исходящего буфера
   m_OutBuffer.SetBuffer(IRIDIUM_BUS_MAX_HEADER_SIZE, IRIDIUM_BUS_CRC_SIZE, m_aOutBuffer, sizeof(m_aOutBuffer));
   m_OutBuffer.Clear();
   
   // Инициализация параметров протокола
   m_OutPH.m_u8Type              = IRIDIUM_BUS_PROTOCOL_ID;
   m_OutPH.m_Flags.m_bPriority   = false;
   m_OutPH.m_Flags.m_bSegment    = false;
   m_OutPH.m_Flags.m_bAddress    = true;
   m_OutPH.m_Flags.m_u2Version   = IRIDIUM_PROTOCOL_BUS_VERSION;
   m_OutPH.m_Flags.m_u3Crypt     = IRIDIUM_CRYPTION_NONE;
   m_OutPH.m_SrcAddr             = 0;
   m_OutPH.m_DstAddr             = 0;
}

/**
   Деструктор класса
*/
CDevice::~CDevice()
{
}

//////////////////////////////////////////////////////////////////////////
// Перегруженные методы для взаимодействия с протоколом
//////////////////////////////////////////////////////////////////////////
/**
   Отправка буфера на устройство
   на входе    :  in_pBuffer  - указатель на буфер с данными
                  in_stSize   - размер данных
   на выходе   :  успешность отправки
*/
bool CDevice::SendPacket(void* in_pBuffer, size_t in_stSize)
{
   while(1)
   {
      // Попробуем отправить буфер в шину
      if(!BUS_Write(true, GetDstAddress(), in_pBuffer, in_stSize))
      {
         // Обработаем входящий буфер во время простоя
         m_InBuffer.FilterNoiseAndForeignPacket(m_Address);
         // Отправка во внешний CAN порт во время простоя
         WriteToExtCan();
      } else
         break;
   }
   return true;
}

/**
   Блокирование доступа к входному буферу
   на входе    :  *
   на выходе   :  данные блокировки
*/
u8 CDevice::LockInBuffer()
{
   //HAL_NVIC_DisableIRQ(USART2_IRQn);
   return 0;
}

/**
   Разблокирование доступа к входному буферу
   на входе    :  in_pData - данные блокировки
   на выходе   :  *
*/
void CDevice::UnLockInBuffer(u8 in_u8Data)
{
}

/**
   Установка локального идентификатора
   на входе    :  in_pszHWID  - указатель на HWID устройства
                  in_u8LID    - локальный идентификатор устройства
   на выходе   :  *
*/
bool CDevice::SetLID(char* in_pszHWID, u8 in_u8LID)
{
   bool l_bResult = false;
   // Проверка HWID
   if(!strcmp(in_pszHWID, g_pszHWID))
   {
      // Запись локального идентификатора в энергонезависимую память
      m_Address = in_u8LID;
      EEPROM_WriteU8(EEPROM_U8_LID, m_Address);
      EEPROM_NeedSaveBuffer();
      // Изменение фильтра
      BUS_SetFilter(g_u16CANID, m_Address);
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Проверка PIN кода для выполнения операции
   на входе    :  in_eType    - тип операции
                  in_u32PIN   - пароль для доступа
                  in_pData    - указатель на данные
   на выходе   :  > 0   - операция доступна
                  = 0   - операция не доступна так как пароль не соответствует
                  < 0   - слишком много неудачных попыток, некоторое время доступ к значению канала будет заблокирован
*/
s8 CDevice::TestPIN(eIridiumOperation in_eType, u32 in_u32PIN, void* in_pData)
{
   s8 l_s8Result = 0;

