iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
   // Получение текущего PIN кода
   u32 l_u32PIN = EEPROM_ReadU32(EEPROM_U32_PIN);

   // Проверка наличия PIN кода, если PIN кода нет, то проверка всегда дает положительный результат
   if(l_u32PIN)
   {
      switch(in_eType)
      {
         // Проверка возможности изменения значения локального адреса
         case IRIDIUM_OPERATION_WRITE_LID:
            l_s8Result = (l_u32PIN == in_u32PIN);
            break;

         // Запись потока
         case IRIDIUM_OPERATION_WRITE_STREAM:
            l_s8Result = 1;
            break;

         default:
            l_s8Result = 0;
      }
   } else
      l_s8Result = 1;

   return l_s8Result;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetSearchInfo(iridium_search_info_t& out_rInfo)
{
   // Заполнение информации об устройстве
   out_rInfo.m_u8Group  = IRIDIUM_GROUP_TYPE_ACTUATOR;
   out_rInfo.m_pszHWID  = (char*)g_pszHWID;
   return true;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetDeviceInfo(iridium_device_info_t& out_rInfo)
{
   bool l_bResult = true;
   // Копирование информации об устройстве
   memcpy(&out_rInfo, &g_DeviceInfo, sizeof(iridium_device_info_t));
   // Информация о каналах
   out_rInfo.m_u32Channels = GetChannels();
   out_rInfo.m_u32Tags = GetTags();
   return l_bResult;
}

/**
   Обработчик получения запроса на открытие потока
   на входе    :  in_pszName  - имя потока
                  in_eMode    - режим открытия потока
   на выходе   :  идентификатор открытого потока, если поток не был открыт возвражаемый результат равен 0
*/
u8 CDevice::StreamOpen(const char* in_pszName, eIridiumStreamMode in_eMode)
{
   u8 l_u8Result = 0;
   // Проверка имени запрашиваемого потока
   if(!g_Firmware.IsOpen() && in_pszName && !strcmp(in_pszName, FIRMWARE_NAME))
   {
      // Проверка на открытие потока для чтения или записи
      if(in_eMode == IRIDIUM_STREAM_MODE_WRITE)
      {
         l_u8Result = FIRMWARE_WRITE_STREAM_ID;
         // Установка адреса
         g_Firmware.SetAddress(GetSrcAddress());
         // Установка идентиифкатора потока
         g_Firmware.SetStreamID(l_u8Result);
         // Установка идентификатора блока
         g_Firmware.SetBlockID(0);
         // Установка времени по истечение которого нужно закрыть поток
         g_Firmware.SetTime(HAL_GetTick() + FIRMWARE_WAIT_TIME);
         // Установка данных потока
         g_Firmware.Open((u8*)FIRMWARE_START, FIRMWARE_SIZE);
      }
   }
   return l_u8Result;
}

/**
   Обработчик получения ответа на запрос открытия потока
   на входе    :  in_pszName     - имя потока
                  in_eMode       - режим открытия потока
                  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamOpenResult(const char* in_pszName, eIridiumStreamMode in_eMode, u8 in_u8StreamID)
{
}

/**
   Обработчик получения запроса передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - размер данных блока
                  in_pBuffer     - указатель на буфер с данными блока
   на выходе   :  количество обработанных данных
*/
size_t CDevice::StreamBlock(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize, const void* in_pBuffer)
{
   u8 l_u8Marker = 0;
   u32 l_u32Size = 0;
   u16 l_u16CRC = 0;
   u8* l_pBuffer = (u8*)in_pBuffer;
   size_t l_stSize = in_stSize;
   bool l_bFirst = false;
   
   // Проверка был ли откры поток, идентификатора потока и размер данных
   if(g_Firmware.IsOpen() && g_Firmware.GetStreamID() == in_u8StreamID && in_stSize >= 16)
   {
      // Проверка на первый блок
      l_bFirst = (g_Firmware.GetPtr() == (u8*)FIRMWARE_START);
      
      // Проверка начала записи данных
      if(l_bFirst)
      {
         // Инициализация блочного шифра
         g_Cipher.EnableIV(true);
         g_Cipher.Init(g_aKeyAndIV);
      }
      
      // Декодирование полученого блока
      g_Cipher.Decode((u8*)in_pBuffer, in_stSize);
      
      // Разблокируем флеш
      HAL_FLASH_Unlock();
      
      // Проверка начала записи данных
      if(l_bFirst)
      {
         // Чтение случайного числа, маркера, размера и контрольной суммы прошивки из заголовка
         l_pBuffer = ReadU8(l_pBuffer, l_u8Marker);
         l_pBuffer = ReadU8(l_pBuffer, l_u8Marker);
         l_pBuffer = ReadU32LE(l_pBuffer, l_u32Size);
         l_pBuffer = ReadU16LE(l_pBuffer, l_u16CRC);
         // Уменьшение размера данных на размер заголовка
         l_stSize -= (l_pBuffer - (u8*)in_pBuffer);
         
         // Проверка размера и маркера
         if(l_u32Size && l_u8Marker == 0x77)
         {
            // Запись информации о прошивке
            EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
            EEPROM_WriteU32(EEPROM_U32_FIRMWARE_SIZE, l_u32Size);
            EEPROM_WriteU16(EEPROM_U16_FIRMWARE_CRC16, l_u16CRC);
            
            // Очистка памяти
            size_t l_stStart = (size_t)g_Firmware.GetPtr();
            size_t l_stEnd = (size_t)(g_Firmware.GetPtr() + g_Firmware.GetSize());
            FLASH_Clear(l_stStart, l_stEnd);
         } else
         {
            // Ошибка: маркер не найден
            in_stSize = 0;
         }
      }
      
      // Проверка на ошибку
      if(in_stSize)
      {
         // Запись во флеш память
         FLASH_Write((u8*)l_pBuffer, (size_t)g_Firmware.GetPtr(), l_stSize);
         // Сдвиг позиции
         g_Firmware.Skip(l_stSize);
         // Установка времени по истечению которого нужно закрыть поток
         g_Firmware.SetTime(HAL_GetTick() + FIRMWARE_WAIT_TIME);
      } else
      {
         // Установим текущее время чтобы закрыть поток
         g_Firmware.SetTime(HAL_GetTick());
      }
      
      // Заблокируем флеш
      HAL_FLASH_Lock();

      // Сохранение информации о прошивке
      if(l_bFirst)
         EEPROM_ForceSaveBuffer();
   }
   return in_stSize;
}

/**
   Обработчик получения ответа на запрос передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - количество обработанных данных
   на выходе   :  *
*/
void CDevice::StreamBlockResult(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize)
{
}

/**
   Обработчик закрытия потока
   на входе    :  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamClose(u8 in_u8StreamID)
{
   // Проверка закрываемого потока
   if(g_Firmware.IsOpen() && g_Firmware.GetStreamID() == in_u8StreamID)
   {
      // Очистка прошивки
      g_Firmware.Close();
      
