iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
      // Запишем в энергонезависимую память состояние
      EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
      EEPROM_ForceSaveBuffer();
      
      // Осуществим переход в загрузчик через сброс контроллера
      Reboot();
   }
}

/**
   Инициализация устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Setup()
{
   iridium_search_info_t l_Search;
   // Загрузка локального идентификатора
   m_Address = EEPROM_ReadU8(EEPROM_U8_LID);

   // Чтение имени устройства
   for(u8 i = 0; i < MAX_DEVICE_NAME_SIZE; i++)
      g_szDeviceName[i] = EEPROM_ReadU8(EEPROM_DEVICE_NAME + i);
      
   // Генерация идентификатора
   GenerateHWID();
   
   // Инициализация шины
   BUS_Init();
   
   // Установка фильтров
   g_u16CANID = GetCRC16Modbus(1, (u8*)g_pszHWID, sizeof(g_pszHWID));
   BUS_SetFilter(g_u16CANID, m_Address);

   // Проверка наличия входов
#if MAX_INPUTS != 0

   // Ожидание в течении 50 миллисекунд нажатия набортной кнопки
   u32 l_u32Time = HAL_GetTick();
   while((HAL_GetTick() - l_u32Time) < 50)
      IO_UpdateInput(g_aInputs, MAX_INPUTS);

   // Получение состояния набортной кнопки
   g_bPress = g_aInputs[0].m_Flags.m_bCurValue;

#endif

   // Отправка информации об устройстве
   if(GetSearchInfo(l_Search))
      SendSearchResponse(GetTID(), l_Search);

   // Выставим режим запуска прошивки, если не режим ожидания прошивки
   u8 l_u8Mode = EEPROM_ReadU8(EEPROM_U8_MODE);
   if(l_u8Mode != BOOTLOADER_MODE_DOWNLOAD)
   {
      EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
      EEPROM_ForceSaveBuffer();
   }
}

/**
   Основной цикл работы устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Loop()
{
   // обработка нажатий
   WorkInputs();
   
   // Обработка сохранения изменений
   EEPROM_WorkBuffer();
   
   // Запись во внешний CAN порт
   WriteToExtCan();

   // Чтение и обработка данных с внешнего CAN порта
   ReadFromExtCan();

   // Получение режима работы
   u8 l_u8Mode = EEPROM_ReadU8(EEPROM_U8_MODE);
   
   // Если загрузчик находится в режиме загрузки прошивки
   if(l_u8Mode == BOOTLOADER_MODE_DOWNLOAD)
   {
      iridium_packet_header_t l_PH;
      m_pInPH = &l_PH;
      
      // Переход в режим получения прошивки
      EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
      EEPROM_ForceSaveBuffer();
      
      // Открытие потока
      u8 l_u8Stream = StreamOpen(FIRMWARE_NAME, IRIDIUM_STREAM_MODE_WRITE);
      
      // Получение параметров для отправки
      m_pInPH->m_SrcAddr         = EEPROM_ReadU16(EEPROM_U16_FIRMWARE_ADDRESS);
      m_InMH.m_Flags.m_u4Version = GetMessageVersion(IRIDIUM_MESSAGE_STREAM_OPEN);
      m_InMH.m_u8Type            = IRIDIUM_MESSAGE_STREAM_OPEN;
      m_InMH.m_u16TID            = EEPROM_ReadU16(EEPROM_U16_FIRMWARE_TID);
      
      // Отправка ответа
      SendStreamOpenResponse(FIRMWARE_NAME, IRIDIUM_STREAM_MODE_WRITE, l_u8Stream);

      g_bPress = false;
   }

   // Контроль работы прошивки
   if(g_Firmware.IsOpen())
   {
      // Если время равно 0 или время вышло, закроем поток
      if(g_Firmware.GetTime() < HAL_GetTick())
      {
         // Пошлем сообщение что поток закрыт
         SendStreamCloseRequest(g_Firmware.GetAddress(), g_Firmware.GetStreamID());
         // Закроем поток
         g_Firmware.Close();
         
         // Запишем в энергонезависимую память состояние
         EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
         EEPROM_ForceSaveBuffer();
         
         // Осуществим переход в загрузчик через сброс контроллера
         Reboot();
      }
   }
}

/**
   Цикл обработки нажатий
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WorkInputs()
{
   // Проверка наличия входов
#if MAX_INPUTS != 0

   iridium_search_info_t l_Search;
   // Обработка нажатий
   IO_UpdateInput(g_aInputs, sizeof(g_aInputs) / sizeof(g_aInputs[0]));

   // Проверка была ли зажата набортная кнопка при старте
   if(g_bPress)
   {
      // Ожидание нажатия набортной 
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue && (HAL_GetTick() - g_aInputs[BUTTON_ONBOARD].m_u32ChangeTime) > 5000)
      {
         // Индикация сброса параметров
         for(size_t i = 0; i < 10; i++)
         {
            HAL_GPIO_TogglePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin);
            HAL_Delay(100);
         }
         // Сбросим PIN код
         EEPROM_WriteU32(EEPROM_U32_PIN, 0);
         // Отметим что устройство надо сбросить
         EEPROM_WriteU8(EEPROM_U8_FIRMWARE_ID, 0xFF);
         // Сброс ключа шифрования
         for(size_t i = 0; i < BLOCK_CIPHER_KEY_SIZE; i++)
            EEPROM_WriteU8(EEPROM_KEY + i, 0);
         // Запись режима загрузки устройства
         EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
         // Насильная запись данных во флешь память
         EEPROM_ForceSaveBuffer();
         // Перезагрузка контроллера
         Reboot();
      }

      // Проверка изменения значения набортной кнопки
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bChange && !g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue)
      {
         eBootloaderMode l_eMode = BOOTLOADER_MODE_RUN;
         // Проверка на переход в режим бутлоадера
         if(g_aInputs[BUTTON_ONBOARD].m_u32IntervalTime >= 1000)
         {
            // Индикация перехода в режим бутлоадера
            for(size_t i = 0; i < 3; i++)
            {
               HAL_GPIO_TogglePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin);
               HAL_Delay(300);
            }
            // Переход в режим бутлоадера
            l_eMode = BOOTLOADER_MODE_BOOT;
         }
         // Запись режима загрузки устройства
         EEPROM_WriteU8(EEPROM_U8_MODE, l_eMode);
         // Насильная запись данных во флешь память
         EEPROM_ForceSaveBuffer();
         // Перезагрузка контроллера
         Reboot();
      }
   } else
   {
      // Если была нажата набортная кнопка, пошлем в шину информацию о себе
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bChange && g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue)
      {
         // Получение информации об устройстве
         if(GetSearchInfo(l_Search))
         {
            // Отправка информации в шину
            SendSearchResponse(GetTID(), l_Search);
         }
      }
   }

#endif
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::ReadFromExtCan()
{
   // Поиск пакета в буфере
   void* l_pBuffer = NULL;
   size_t l_stSize = 0;
   bool l_bResult = false;
   
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Чтение входящих сообщений
      HAL_CAN_Receive_IT(&hcan, CAN_FIFO0); 

      // Получение пакета
      l_bResult = l_pPort->GetPacket(l_pBuffer, l_stSize);
      
      // Блокирование доступа к порту
      LockCANPort(&hcan);
      // Удаление обработанных пакетов
      l_pPort->Flush();
      // Разблокирование доступа к порту
      UnLockCANPort(&hcan);
      
      // Проверка наличия данных
      if(l_bResult)
      {
         // Установка данных буфера
         m_InBuffer.SetBuffer(l_pBuffer, l_stSize);
         
         // Отфильтруем лишнее
         m_InBuffer.FilterNoiseAndForeignPacket(m_Address);
   
