iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
         // Обрабатывать входящий поток пока исходящий буфер не заполнен на половину
         if(m_InBuffer.OpenPacket())
         {
            iridium_packet_header_t* l_pPH = m_InBuffer.GetPacketHeader();
      
            void* l_pPacketPtr = m_InBuffer.GetMessagePtr();
            size_t l_stPacketSize = m_InBuffer.GetMessageSize();
      
#if defined(IRIDIUM_ENABLE_CIPHER)
            // Декодирование сообщения
            if(DecodeMessage((eIridiumCipher)l_pPH->m_Flags.m_u3Crypt, m_InBuffer.GetMessagePtr(), m_InBuffer.GetMessageSize(), l_pPacketPtr, l_stPacketSize))
#endif
            {
               // Обработка сообщения
               ProcessMessage(l_pPH, l_pPacketPtr, l_stPacketSize);
            }
            // Закрытие шинного сообщения
            m_InBuffer.ClosePacket();
         }
         
         // Обработка полученого пакета
         l_pPort->DeletePacket();
      }
   }
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WriteToExtCan()
{
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Получим фрейм для отправки в CAN
      can_frame_t* l_pPtr = l_pPort->GetFrame();
      if(l_pPtr)
      {
         // Установим расширенный размер кадра
         hcan.pTxMsg->IDE = CAN_ID_EXT;
      
         // Назначаем идентификатор сообщения
         hcan.pTxMsg->ExtId = l_pPtr->m_u32ExtID;
      
         // Указываем длинну сообщения
         hcan.pTxMsg->DLC = l_pPtr->m_u8Size;
      
         // Копируем данные для отправки
         memcpy(hcan.pTxMsg->Data, l_pPtr->m_aData, l_pPtr->m_u8Size);
      
         // Отправляем данные
         if(HAL_CAN_Transmit_IT(&hcan) == HAL_OK)
            l_pPort->DeleteFrame();
      }
   }
}

/**
   Вызов инициализации устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Init()
{
   // Установка границ энергонезависимой памяти
   EEPROM_Init(EEPROM_START, EEPROM_END);
   
   // Включение буферизации EEPROM
   EEPROM_SetBuffer(g_aEEPROM, EEPROM_MAX);
}

/**
   Вызов настройки устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Setup()
{
   g_Device.Setup();
}

/**
   Вызов основного цикла устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Loop()
{
   g_Device.Loop();
}
